English/NCE3/L36 A chance in a million.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* Lesson 36 A chance in a million
#+begin_verse
What was the chance in a million?

We are less credulous than we used to be.
In the nineteenth century, a novelist would *bring his history to a conclusion*
	by presenting his readers with a series of coincidences -- most of them *wildly improbable*.
Readers happily *accepted the fact that* an obscure maidservant was really the hero's mother.
A long-lost brother, who *was presumed dead*, was really alive all the time
	and wickedly *plotting to bring about the hero's downfall*.
*And so on*.
Modern readers would find such naive solutions totally unacceptable.
Yet, in real life, circumstances do sometimes *conspire to* bring about coincidences
	which *anyone but* a nineteenth century novelist would find incredible.

When I was a boy,
	my grandfather told me
		how a German taxi driver, Franz Bussman, found a brother
			who *was thought to* have been killed twenty years before.
While on a walking tour with his wife, he *stopped to* talk to a workman.
After they had gone on,
	Mrs. Bussman *commented on the workman's close resemblance to her husband*
		and even *suggested that* he might be his brother.
Franz *poured scorn on* the idea,
	pointing out that his brother had been killed in action during the war.
Though Mrs. Bussman *was fully acquainted with* this story,
	she thought that *there was a chance in a million that* she might be right.
A few days later, she sent a boy to the workman to ask him
	if his name was Hans Bussman.
*Needless to say*, the man's name was Hans Bussman and he really was Franz's long-lost brother.
When the brothers *were reunited*, Hans explained how it was that he was still alive.
After having been wounded *towards the end of the war*,
	he had been sent to hospital and *was separated from* his unit.
The hospital had been bombed and Hans had *made his way back into* Western Germany on foot.
Meanwhile, his unit was lost and all records of him had been destroyed.
Hans *returned to* his family home,
	but the house had been bombed
		and no one in the neighbourhood knew what had *become of* the inhabitants.
*Assuming that* his family had been killed during an air raid,
	Hans settled down in a village fifty miles away where he had remained ever since.
#+end_verse
** expression
credulous: [ˈkredjələs] adj. 轻信的
improbable: [ɪmˈprɑbəb(ə)l] adj. 不大可能的
obscure: [əbˈskjʊr] adj. 不起眼的
maidservant: [ˈmeɪdˌsɜrvənt] n. 女仆
presume: [prɪˈzum] v. 假定
wickedly: ['wɪkɪdli] adv. 心眼坏地
plot: [plɑt] v. 密谋
downfall: [ˈdaʊnˌfɔl] n. 倒台
naive: [nɑˈiv] adj. 天真的
unacceptable: [ˌʌnəkˈseptəb(ə)l] adj.不能接受的
conspire: [kənˈspaɪr] v.巧合促成
incredible: [ɪnˈkredəb(ə)l] adj.难以置信的
resemblance: [rɪˈzembləns] n.相似
scorn: [skɔrn] n.嘲弄
acquaint: [əˈkweɪnt] v.使了解
reunite: [ˌrijuˈnaɪt] v.使团聚
assume: [əˈsum] v.假定,认为

It seems (highly/wildly) improbable that + ...: 似乎不可能
be presumed dead/innocent/guilty: 假定死亡/无辜/有罪
presume that + ...: 假定...
plot to do sth.: 密谋做某事
plot against sb.: 暗算某人
lead to sb's downfall: 导致某人的垮台
bring about sb's downfall: 使某人垮台
it be naive enough to believe/think + ...: 相信/认为+...是足够天真的
sb. be naive enough to believe/think + ...:某人足够天真才会相信/认为+...
it be unacceptable to do sth.: 做某事是不可接受的
conspire to do sth.: 合谋做某事
it is incredible (to sb.) that + ...: 难以置信的
it is incredible how + ...: 难以置信多么地...
it is incredible to do sth.: 做某事是难以置信的
bear a close/strong/striking resemblance to sb./sth.: 对某人/物非常相似
bear little/no resemblance to sb./sth.: 对某人/物不相似
resemblance to ...: 对...的相似
pour scorn on: 嘲笑
pour scorn on the idea/suggestion/plan/advice: 嘲笑...
acquaint sb. with sth.: 使某人熟悉某事物
sb. be acquainted with sth.: 某人熟悉了某物
be reunited with sb.: 和某人团聚
assuming that + ...: 假设...
it seems/is reasonable to assume that + ...: 假设...是合理的
--------------------
to do 非谓语结构
--------------------
a chance in a million: 百万分之一
bring ... to a conclusion: 把...结束
sb. accepted the fact that: 某人接受事实...
bring about sth.: 引起某事
and so on: 等等
anyone but: 所有人除了...
be thought to: 被认为...
stop to do:停下来去做某事 VS stop doing sth: 停下来做的事情
comment on sth./sb.: 评论...
suggest that + ...: 建议虚拟语气; 假设不用虚拟语气
there is/was a chance that + ...: ...有可能
needless to say: 不用说
towards the end of + sth.: 接近...的结尾
be separated from: 与...分离
make one's way back to sp.: 回某地
return to: 回去
What become of: 怎么了

** words
credulous [ˈkredʒələs] adj.轻信的
improbable [ɪmˈprɑːbəbl] ad.不太可能的
obscure [əbˈskjʊr] adj.不起眼的
maidservant [ˈmeɪdsɜːrvənt] n.女仆
presume [prɪˈzuːm] v.假定
wickedly [ˈwɪkɪdli] adv.心眼坏地
plot [plɑːt] v.密谋
downfall [ˈdaʊnfɔːl] n.倒台
naive [naɪˈiːv] adj.天真的
unacceptable [ˌʌnəkˈseptəbl] adj.不能接受的
conspire [kənˈspaɪər] v.(事件)巧合促成
incredible [ɪnˈkredəb(ə)l] adj.难以置信的
resemblance [rɪˈzembləns] n.相似
scorn [skɔːrn] n.嘲弄
acquaint [əˈkweɪnt] v.使了解
reunite [ˌriːjuˈnaɪt] v.使团聚
assume [əˈsuːm] v.假定,认为

** DONE vocabulary
CLOSED: [2024-01-05 Fri 19:39]
credulous: willing to believe without proof
a conclusion: an ending
improbable: not likely to happen, unlikely
presumed: believed to be, assumed to be
plotting: secretly planning
totally: completely
bring about: cause to happen

