NCE3/L36 A chance in a million.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-28 Sat 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org522da63" class="outline-2">
<h2 id="org522da63">Lesson 36 A chance in a million</h2>
<div class="outline-text-2" id="text-org522da63">
<p class="verse">
What was the chance in a million?<br />
<br />
We are less credulous than we used to be.<br />
In the nineteenth century, a novelist would <b>bring his history to a conclusion</b><br />
&#xa0;by presenting his readers with a series of coincidences &#x2013; most of them <b>wildly improbable</b>.<br />
Readers happily <b>accepted the fact that</b> an obscure maidservant was really the hero's mother.<br />
A long-lost brother, who <b>was presumed dead</b>, was really alive all the time<br />
&#xa0;and wickedly <b>plotting to bring about the hero's downfall</b>.<br />
<b>And so on</b>.<br />
Modern readers would find such naive solutions totally unacceptable.<br />
Yet, in real life, circumstances do sometimes <b>conspire to</b> bring about coincidences<br />
&#xa0;which <b>anyone but</b> a nineteenth century novelist would find incredible.<br />
<br />
When I was a boy,<br />
&#xa0;my grandfather told me<br />
&#xa0;&#xa0;how a German taxi driver, Franz Bussman, found a brother<br />
&#xa0;&#xa0;&#xa0;who <b>was thought to</b> have been killed twenty years before.<br />
While on a walking tour with his wife, he <b>stopped to</b> talk to a workman.<br />
After they had gone on,<br />
&#xa0;Mrs. Bussman <b>commented on the workman's close resemblance to her husband</b><br />
&#xa0;&#xa0;and even <b>suggested that</b> he might be his brother.<br />
Franz <b>poured scorn on</b> the idea,<br />
&#xa0;pointing out that his brother had been killed in action during the war.<br />
Though Mrs. Bussman <b>was fully acquainted with</b> this story,<br />
&#xa0;she thought that <b>there was a chance in a million that</b> she might be right.<br />
A few days later, she sent a boy to the workman to ask him<br />
&#xa0;if his name was Hans Bussman.<br />
<b>Needless to say</b>, the man's name was Hans Bussman and he really was Franz's long-lost brother.<br />
When the brothers <b>were reunited</b>, Hans explained how it was that he was still alive.<br />
After having been wounded <b>towards the end of the war</b>,<br />
&#xa0;he had been sent to hospital and <b>was separated from</b> his unit.<br />
The hospital had been bombed and Hans had <b>made his way back into</b> Western Germany on foot.<br />
Meanwhile, his unit was lost and all records of him had been destroyed.<br />
Hans <b>returned to</b> his family home,<br />
&#xa0;but the house had been bombed<br />
&#xa0;&#xa0;and no one in the neighbourhood knew what had <b>become of</b> the inhabitants.<br />
<b>Assuming that</b> his family had been killed during an air raid,<br />
&#xa0;Hans settled down in a village fifty miles away where he had remained ever since.<br />
</p>
</div>
<div id="outline-container-orgf294ddc" class="outline-3">
<h3 id="orgf294ddc">expression</h3>
<div class="outline-text-3" id="text-orgf294ddc">
<p>
credulous: [ˈkredjələs] adj. 轻信的<br />
improbable: [ɪmˈprɑbəb(ə)l] adj. 不大可能的<br />
obscure: [əbˈskjʊr] adj. 不起眼的<br />
maidservant: [ˈmeɪdˌsɜrvənt] n. 女仆<br />
presume: [prɪˈzum] v. 假定<br />
wickedly: ['wɪkɪdli] adv. 心眼坏地<br />
plot: [plɑt] v. 密谋<br />
downfall: [ˈdaʊnˌfɔl] n. 倒台<br />
naive: [nɑˈiv] adj. 天真的<br />
unacceptable: [ˌʌnəkˈseptəb(ə)l] adj.不能接受的<br />
conspire: [kənˈspaɪr] v.巧合促成<br />
incredible: [ɪnˈkredəb(ə)l] adj.难以置信的<br />
resemblance: [rɪˈzembləns] n.相似<br />
scorn: [skɔrn] n.嘲弄<br />
acquaint: [əˈkweɪnt] v.使了解<br />
reunite: [ˌrijuˈnaɪt] v.使团聚<br />
assume: [əˈsum] v.假定,认为<br />
</p>

<p>
It seems (highly/wildly) improbable that + &#x2026;: 似乎不可能<br />
be presumed dead/innocent/guilty: 假定死亡/无辜/有罪<br />
presume that + &#x2026;: 假定&#x2026;<br />
plot to do sth.: 密谋做某事<br />
plot against sb.: 暗算某人<br />
lead to sb's downfall: 导致某人的垮台<br />
bring about sb's downfall: 使某人垮台<br />
it be naive enough to believe/think + &#x2026;: 相信/认为+&#x2026;是足够天真的<br />
sb. be naive enough to believe/think + &#x2026;:某人足够天真才会相信/认为+&#x2026;<br />
it be unacceptable to do sth.: 做某事是不可接受的<br />
conspire to do sth.: 合谋做某事<br />
it is incredible (to sb.) that + &#x2026;: 难以置信的<br />
it is incredible how + &#x2026;: 难以置信多么地&#x2026;<br />
it is incredible to do sth.: 做某事是难以置信的<br />
bear a close/strong/striking resemblance to sb./sth.: 对某人/物非常相似<br />
bear little/no resemblance to sb./sth.: 对某人/物不相似<br />
resemblance to &#x2026;: 对&#x2026;的相似<br />
pour scorn on: 嘲笑<br />
pour scorn on the idea/suggestion/plan/advice: 嘲笑&#x2026;<br />
acquaint sb. with sth.: 使某人熟悉某事物<br />
sb. be acquainted with sth.: 某人熟悉了某物<br />
be reunited with sb.: 和某人团聚<br />
assuming that + &#x2026;: 假设&#x2026;<br />
it seems/is reasonable to assume that + &#x2026;: 假设&#x2026;是合理的<br />
</p>
<hr />
<p>
to do 非谓语结构<br />
</p>
<hr />
<p>
a chance in a million: 百万分之一<br />
bring &#x2026; to a conclusion: 把&#x2026;结束<br />
sb. accepted the fact that: 某人接受事实&#x2026;<br />
bring about sth.: 引起某事<br />
and so on: 等等<br />
anyone but: 所有人除了&#x2026;<br />
be thought to: 被认为&#x2026;<br />
stop to do:停下来去做某事 VS stop doing sth: 停下来做的事情<br />
comment on sth./sb.: 评论&#x2026;<br />
suggest that + &#x2026;: 建议虚拟语气; 假设不用虚拟语气<br />
there is/was a chance that + &#x2026;: &#x2026;有可能<br />
needless to say: 不用说<br />
towards the end of + sth.: 接近&#x2026;的结尾<br />
be separated from: 与&#x2026;分离<br />
make one's way back to sp.: 回某地<br />
return to: 回去<br />
What become of: 怎么了<br />
</p>
</div>
</div>

<div id="outline-container-org61576f4" class="outline-3">
<h3 id="org61576f4">words</h3>
<div class="outline-text-3" id="text-org61576f4">
<p>
credulous [ˈkredʒələs] adj.轻信的<br />
improbable [ɪmˈprɑːbəbl] ad.不太可能的<br />
obscure [əbˈskjʊr] adj.不起眼的<br />
maidservant [ˈmeɪdsɜːrvənt] n.女仆<br />
presume [prɪˈzuːm] v.假定<br />
wickedly [ˈwɪkɪdli] adv.心眼坏地<br />
plot [plɑːt] v.密谋<br />
downfall [ˈdaʊnfɔːl] n.倒台<br />
naive [naɪˈiːv] adj.天真的<br />
unacceptable [ˌʌnəkˈseptəbl] adj.不能接受的<br />
conspire [kənˈspaɪər] v.(事件)巧合促成<br />
incredible [ɪnˈkredəb(ə)l] adj.难以置信的<br />
resemblance [rɪˈzembləns] n.相似<br />
scorn [skɔːrn] n.嘲弄<br />
acquaint [əˈkweɪnt] v.使了解<br />
reunite [ˌriːjuˈnaɪt] v.使团聚<br />
assume [əˈsuːm] v.假定,认为<br />
</p>
</div>
</div>

<div id="outline-container-org7475d39" class="outline-3">
<h3 id="org7475d39"><span class="done DONE">DONE</span> vocabulary</h3>
<div class="outline-text-3" id="text-org7475d39">
<p>
credulous: willing to believe without proof<br />
a conclusion: an ending<br />
improbable: not likely to happen, unlikely<br />
presumed: believed to be, assumed to be<br />
plotting: secretly planning<br />
totally: completely<br />
bring about: cause to happen<br />
</p>
</div>
</div>
