English/NCE3/L36 A chance in a million.org
** DONE 单词造句
CLOSED: [2024-01-04 Thu 09:54]
credulous adj.
- He is less credulous than he used to be, for he has some opinions based on his values.
- He is not credulous so that he avoided being fooled by authorities.
- I am so credulous that I am unable to make a decision by myself.
- The credulous boy played truent from school by listening to his partner.
- If you were less credulous, you would make less mistakes.
improbable adj.  It seems (highly/wildly) improbable that + ...
- It seems improbable that a pretty broke into the jewelry store during night.
- It seems improbable that the gangster has been handed over to the US government.
- It seems improbable that she has ran to tell her parents.
- It seems improbable that she made no mistake on the exam.
- It seems improbable that justice ceases to be an abstract concept in such situation.
obscure adj.
- The obscure maidservant claimed that justice has been done in the courts of law.
- The obscure prizefighter managed to prove his innocence.
- The obscure artist who wanted to rise to fame undertook an ardulous task.
- It is an obscure student who understands these abstract concepts.
- The obscure grocer turned out to be the ganster who broke into the store.
maidservant n.
- The maidservant went through arduous journey in the desert island of her own accord.
- The maidservant was invited to do housework in a desert island.
- In those days, maidservants were more likely to get a good salary.
- The maidservant converted the house into her grocery.
- A figure that emerged from the room was recognized as a maidservant.
presume v.  be presumed dead/innocent/guilty  presume that + ...
- If he had been presumsed dead, his wife would have had a perfect alibi.
- The gangster was presumed innocent by his lawyer in the courts of law.
- I presumed that you had passed the exam.
- She presumed that I cheated on her on vocation.
- I begged my wife not to presumed that I had cheated on her in New York.
wickedly adv.
- He wickedly described to me how to kidnap a lovable cat.
- The witch wickedly begged the princess to drink some water in the well.
- The evil boy wickedly prised the chest open.
- Wickedly laughing, he kicked his partner's ass.
- The witch wickedly carved a ghost out of the wood.
plot v.  plot to do sth.  plot against sb.
- There is always hope that a ugly gilr plots against heroine in these stories.
- He ploted to breakn into the antique shop.
- In the labyrinth of the room, they ploted to play truent from school.
- He cherished the hope that they ploted to betray against the king.
- The mere fact that they ploted to cheat on exam has a bad influence in our school.
downfall n.  lead to sb's downfall  bring about sb's downfall
- The mistakes she made in the contest led to her downfall by chance.
- Above all, such stupid remarks might lead to your downfall.
- My wife described to me how she brought about her boss' downfall.
- No one but enemy will benefit from the accident which brought about his downfall.
- The affairs piled up and led to his downfall.
naive adj.  it be naive enough to believe/think + ...  sb. be naive enough to believe/think + ...
- I am naive enough to believe that kindness will always be rewarded.
- She is naive enough to think that a man who runs a successful business is gonna marry her.
- It is naive enough to believe that she collided with a car on April 1st.
- It is naive enough to think that  a dog caused a series of accidents.
- I am naive enough to believe that you have told me the truth.
unacceptable adj.  it be unacceptable to do sth.
- It is unacceptable to reduce your wife to tears.
- It is unacceptable to keep an eye on my neighbor while studying.
- It is unacceptable to set the boat on fire.
- It is unacceptable to set up a chain of reactions.
- It is unacceptable to talk on the phone in the open air.
conspire v.  conspire to
- They conspired to kill a regiment of stray dogs.
- I was under the impression that they conspired to cheat on the exam.
- This gave me the impression that they conspired to kidnap my cat.
- They conspired to stay overnight in the hay.
- I woke up to find that they conspired to keep me in hiding.
incredible adj.
	it is incredible (to sb.) that + ...
	it is incredible how + ...
	it is incredible to do sth.
- It is incredible to me that he is willing to show me to his room.
- It is incredible how he sold a diamond as large as marbles.
- It is incredible how she poisoned her five husbands in her youth.
- It is incredible to bring a parcel of diamonds with my wife.
- It is incredible to me that he turns out to be a medical student.
resemblance n.
	bear a close/strong/striking resemblance to sb./sth.
	bear little/no resemblance to sb./sth.
	resemblance to ...
- Following in his father's footsteps, he bears a close resemblance to his father.
- The young lady claimed that his husband bears a strong resemblance to the workman.
- Some neighbors said that he bears little resemblance to his son.
- It gave me the impression that we bear a string resemblance to each other.
- His strong resemblance to a pirate makes my hair stand on end.
scorn n.  pour scorn on (idea/suggestion/plan/advice)
- It is all very well that you pour scorn on someone who discuss you.
- He is always pouring scorn on advice others give in his youth.
- He was about to pour scorn on her suggestion when his teacher came in.
- Once upon a time, there is a prince pouring scorn on his fellow soldier.
- I poured scorn on the advice that we concealed from our boss the fact that the project failed.
acquint v.  acquaint sb. with sth.  sb. be acquainted with sth.
- My wife was quite acquainted with my habit of smoking after dinner.
- My wife seems to be acquainted with the science fiction which was published recently.
- To varying degrees, I am acquainted with the monastery at St. Bernard.
- Even if you are acquainted with my body, please don't come in while I am taking a bath.
- These skiers were quite acquainted with the monastery where they received a warm welcom.
reunite v.  be reunited with sb.
- Imagine my dismay when I found that I could be reunited with my wife even after the war.
- So long as I am reunited with my child, I will deal with your problem.
- For your own protection, you'd better be reunited with your parents.
- The noble was reunited with his people and was given a state funeral.
- We'll be reunited with each other in US.
assume v.  assuming that + ...  it seems/is reasonable to assume that + ...
- It seems to assume that our company made a profit.
- Assuming that he was dead, they moved to a street.
- Assuming that he had finished homework, he was about to go to party.
- Assuming that they had an opportunity to meet queen, they were dressed in smart suits.
- Assuming that the boat was loaded with treasure, a group of pirates let out a cry.

** DONE 反复听电影片段直到懂关键句
CLOSED: [2024-01-05 Fri 19:35]
