NCE3/L36 A chance in a million.html

<div id="outline-container-org1eb871d" class="outline-3">
<h3 id="org1eb871d"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org1eb871d">
<p>
credulous adj.<br />
</p>
<ul class="org-ul">
<li>He is less credulous than he used to be, for he has some opinions based on his values.<br /></li>
<li>He is not credulous so that he avoided being fooled by authorities.<br /></li>
<li>I am so credulous that I am unable to make a decision by myself.<br /></li>
<li>The credulous boy played truent from school by listening to his partner.<br /></li>
<li>If you were less credulous, you would make less mistakes.<br /></li>
</ul>
<p>
improbable adj.  It seems (highly/wildly) improbable that + &#x2026;<br />
</p>
<ul class="org-ul">
<li>It seems improbable that a pretty broke into the jewelry store during night.<br /></li>
<li>It seems improbable that the gangster has been handed over to the US government.<br /></li>
<li>It seems improbable that she has ran to tell her parents.<br /></li>
<li>It seems improbable that she made no mistake on the exam.<br /></li>
<li>It seems improbable that justice ceases to be an abstract concept in such situation.<br /></li>
</ul>
<p>
obscure adj.<br />
</p>
<ul class="org-ul">
<li>The obscure maidservant claimed that justice has been done in the courts of law.<br /></li>
<li>The obscure prizefighter managed to prove his innocence.<br /></li>
<li>The obscure artist who wanted to rise to fame undertook an ardulous task.<br /></li>
<li>It is an obscure student who understands these abstract concepts.<br /></li>
<li>The obscure grocer turned out to be the ganster who broke into the store.<br /></li>
</ul>
<p>
maidservant n.<br />
</p>
<ul class="org-ul">
<li>The maidservant went through arduous journey in the desert island of her own accord.<br /></li>
<li>The maidservant was invited to do housework in a desert island.<br /></li>
<li>In those days, maidservants were more likely to get a good salary.<br /></li>
<li>The maidservant converted the house into her grocery.<br /></li>
<li>A figure that emerged from the room was recognized as a maidservant.<br /></li>
</ul>
<p>
presume v.  be presumed dead/innocent/guilty  presume that + &#x2026;<br />
</p>
<ul class="org-ul">
<li>If he had been presumsed dead, his wife would have had a perfect alibi.<br /></li>
<li>The gangster was presumed innocent by his lawyer in the courts of law.<br /></li>
<li>I presumed that you had passed the exam.<br /></li>
<li>She presumed that I cheated on her on vocation.<br /></li>
<li>I begged my wife not to presumed that I had cheated on her in New York.<br /></li>
</ul>
<p>
wickedly adv.<br />
</p>
<ul class="org-ul">
<li>He wickedly described to me how to kidnap a lovable cat.<br /></li>
<li>The witch wickedly begged the princess to drink some water in the well.<br /></li>
<li>The evil boy wickedly prised the chest open.<br /></li>
<li>Wickedly laughing, he kicked his partner's ass.<br /></li>
<li>The witch wickedly carved a ghost out of the wood.<br /></li>
</ul>
<p>
plot v.  plot to do sth.  plot against sb.<br />
</p>
<ul class="org-ul">
<li>There is always hope that a ugly gilr plots against heroine in these stories.<br /></li>
<li>He ploted to breakn into the antique shop.<br /></li>
<li>In the labyrinth of the room, they ploted to play truent from school.<br /></li>
<li>He cherished the hope that they ploted to betray against the king.<br /></li>
<li>The mere fact that they ploted to cheat on exam has a bad influence in our school.<br /></li>
</ul>
<p>
downfall n.  lead to sb's downfall  bring about sb's downfall<br />
</p>
<ul class="org-ul">
<li>The mistakes she made in the contest led to her downfall by chance.<br /></li>
<li>Above all, such stupid remarks might lead to your downfall.<br /></li>
<li>My wife described to me how she brought about her boss' downfall.<br /></li>
<li>No one but enemy will benefit from the accident which brought about his downfall.<br /></li>
<li>The affairs piled up and led to his downfall.<br /></li>
</ul>
<p>
naive adj.  it be naive enough to believe/think + &#x2026;  sb. be naive enough to believe/think + &#x2026;<br />
</p>
<ul class="org-ul">
<li>I am naive enough to believe that kindness will always be rewarded.<br /></li>
<li>She is naive enough to think that a man who runs a successful business is gonna marry her.<br /></li>
<li>It is naive enough to believe that she collided with a car on April 1st.<br /></li>
<li>It is naive enough to think that  a dog caused a series of accidents.<br /></li>
<li>I am naive enough to believe that you have told me the truth.<br /></li>
</ul>
<p>
unacceptable adj.  it be unacceptable to do sth.<br />
</p>
<ul class="org-ul">
<li>It is unacceptable to reduce your wife to tears.<br /></li>
<li>It is unacceptable to keep an eye on my neighbor while studying.<br /></li>
<li>It is unacceptable to set the boat on fire.<br /></li>
<li>It is unacceptable to set up a chain of reactions.<br /></li>
<li>It is unacceptable to talk on the phone in the open air.<br /></li>
</ul>
<p>
conspire v.  conspire to<br />
</p>
<ul class="org-ul">
<li>They conspired to kill a regiment of stray dogs.<br /></li>
<li>I was under the impression that they conspired to cheat on the exam.<br /></li>
<li>This gave me the impression that they conspired to kidnap my cat.<br /></li>
<li>They conspired to stay overnight in the hay.<br /></li>
<li>I woke up to find that they conspired to keep me in hiding.<br /></li>
</ul>
<p>
incredible adj.<br />
	it is incredible (to sb.) that + &#x2026;<br />
	it is incredible how + &#x2026;<br />
	it is incredible to do sth.<br />
</p>
<ul class="org-ul">
<li>It is incredible to me that he is willing to show me to his room.<br /></li>
<li>It is incredible how he sold a diamond as large as marbles.<br /></li>
<li>It is incredible how she poisoned her five husbands in her youth.<br /></li>
<li>It is incredible to bring a parcel of diamonds with my wife.<br /></li>
<li>It is incredible to me that he turns out to be a medical student.<br /></li>
</ul>
<p>
resemblance n.<br />
	bear a close/strong/striking resemblance to sb./sth.<br />
	bear little/no resemblance to sb./sth.<br />
	resemblance to &#x2026;<br />
</p>
<ul class="org-ul">
<li>Following in his father's footsteps, he bears a close resemblance to his father.<br /></li>
<li>The young lady claimed that his husband bears a strong resemblance to the workman.<br /></li>
<li>Some neighbors said that he bears little resemblance to his son.<br /></li>
<li>It gave me the impression that we bear a string resemblance to each other.<br /></li>
<li>His strong resemblance to a pirate makes my hair stand on end.<br /></li>
</ul>
<p>
scorn n.  pour scorn on (idea/suggestion/plan/advice)<br />
</p>
<ul class="org-ul">
<li>It is all very well that you pour scorn on someone who discuss you.<br /></li>
<li>He is always pouring scorn on advice others give in his youth.<br /></li>
<li>He was about to pour scorn on her suggestion when his teacher came in.<br /></li>
<li>Once upon a time, there is a prince pouring scorn on his fellow soldier.<br /></li>
<li>I poured scorn on the advice that we concealed from our boss the fact that the project failed.<br /></li>
</ul>
<p>
acquint v.  acquaint sb. with sth.  sb. be acquainted with sth.<br />
</p>
<ul class="org-ul">
<li>My wife was quite acquainted with my habit of smoking after dinner.<br /></li>
<li>My wife seems to be acquainted with the science fiction which was published recently.<br /></li>
<li>To varying degrees, I am acquainted with the monastery at St. Bernard.<br /></li>
<li>Even if you are acquainted with my body, please don't come in while I am taking a bath.<br /></li>
<li>These skiers were quite acquainted with the monastery where they received a warm welcom.<br /></li>
</ul>
<p>
reunite v.  be reunited with sb.<br />
</p>
<ul class="org-ul">
<li>Imagine my dismay when I found that I could be reunited with my wife even after the war.<br /></li>
<li>So long as I am reunited with my child, I will deal with your problem.<br /></li>
<li>For your own protection, you'd better be reunited with your parents.<br /></li>
<li>The noble was reunited with his people and was given a state funeral.<br /></li>
<li>We'll be reunited with each other in US.<br /></li>
</ul>
<p>
assume v.  assuming that + &#x2026;  it seems/is reasonable to assume that + &#x2026;<br />
</p>
<ul class="org-ul">
<li>It seems to assume that our company made a profit.<br /></li>
<li>Assuming that he was dead, they moved to a street.<br /></li>
<li>Assuming that he had finished homework, he was about to go to party.<br /></li>
<li>Assuming that they had an opportunity to meet queen, they were dressed in smart suits.<br /></li>
<li>Assuming that the boat was loaded with treasure, a group of pirates let out a cry.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org9d7003f" class="outline-3">
<h3 id="org9d7003f"><span class="done DONE">DONE</span> 反复听电影片段直到懂关键句</h3>
<div class="outline-text-3" id="text-org9d7003f">
</div>
</div>
