English/NCE3/L36 A chance in a million.org
** 复习二册语法(笔记或视频) & 红皮书
** DONE 习惯用法造句
CLOSED: [2024-01-04 Thu 11:25]
a chance in a million
- There is a chance in a million that you win the lottery.
- There is a chance in a million that I make a name for myself.
- There was a chance in a million that she came to play football.
- There is a chance in a million that he offers to do the dishes.
- There is a chance in a million that our company makes a profit this year.
bring ... to a conclusion
- As the writer was put out of business, he couldn't bring his novel to a conclusion.
- He brought his novel to a conclusion by a accident setting up a series of reactions.
- He brought his novel to a conclusion by appearing a driver who pulled up.
- He brought his novel to a conclusion by getting the traffic on the move again.
- He brought his story to a conclusion
		by the situation that prince and princess live happily together.
sb. accepted the fact that 
- We accepted the fact that our child failed the exam.
- He accepted the fact that his son was killed in action during war.
- The boss accepted the fact that his workmen was in traffic jam.
- He accepted the fact that his room was littered with junk foods.
- I accepeted the fact that the chest I hid was prised open by someone.
bring about
- This brought about the kidnap of my cat.
- They conspired to destory the suspended bridge
		so that this brought about the downfall of our president.
- They plotted to bring about the president's downfall.
- Everyone cherishes the hope that this brought about the president's downfall.
- The mere fact that it brought about the president's downfall has a deep influence on me.
and so on
- A rabbit was carved from a wood, and so on.
- The kidnapper asked for a ransom of $10,000, and so on.
- Considering his lovable cat, he agreed to pay a ransom of $10,000, and so on.
- Following my father's instrcutions, I kept my word and went to the police, and so on.
- She explained that there were girls, boys, and so on.
anyone but
- My fellow told me that anyone but you takes the task seriously.
- Anyone but you changed your mind and followed Mr Leo's instructions.
- Sure enough, anyone but your husband commited a murder.
- Anyone but the poor gilr didn't leav in an orderly fashion.
- It astounded me that anyone but you went in front of the camp up and down.
be thought to
- The woman was thought to be a servant who poisoned her five husbands.
- The puma was thought to escape from a private collector.
- I was thought to take my job seriously.
- He was thought to be killed in action during war.
- He was thought to have seen a puma at large.
stop to do
- I stopped to prove it right.
- He stopped to catch sight of his father.
- I'm glad that you stopped to study.
- He stopped to have a rest in the afternoon.
- He stopped to show his identity car to the security in front of the gate.
comment on
- It is disturbing to hear that someone comments on a film that we haven't seen.
- She gets used to commenting on other's personal lifes in the open.
- No one will comment on a room that was used as a place of worship.
- It is considered unlucky for people commenting on god at the monastery.
- She was expect to comment on our story in the contest.
suggest that + ...
- I suggest that she played truent from school.
- I suggest that this will cause an strange situation.
- She suggests that she got enough money to buy the house.
- I suggest that I get used to working in office.
- She suggests that the room was used a place of worship.
there is/was a chance that + ...
- There is a chance that she will give us a surprise.
- There is a chance that the archaeologist made a real discovery.
- There is a chance that a bargain hunter found something valuable in antique shop.
- There is a chance that she recognized your brother as her father.
- There is a chance that she was quipped with a torchlight.
needless to say
- Needless to say, she happened to wander around the park.
- Needless to say, the ring dates back to 10th century.
- Needless to say, he was amazed to find that they had to abandon ship.
- Needless to say, it turned out to be a little boy.
- Needless to say, he sacrificed his pocket money for a long journey.
towards the end of + sth.
- People return to their home towards the end of the year.
- I'll keep the secret towards the end of the month.
- You'll have the privilege of meeting the queen towards the end of the year.
- She didn't take a shower towards the end of the year.
- We are gonna to keep the status quo towards the end of the year.
be separated from
- He was separetaed from his unit and survived.
- It was me who was separeted from my parents at very young age.
- Such is human nature, that we are unwilling to be separeted from our couple.
- This can give rise to curious situation,
		as it did in the case of Mr. Leo who was separeted from his wife.
- The man separeted from his wife during the war was persumed dead.
make one's way back to
- The turtle goes to extreme to make its way back to the sea.
- In the end, the snake makes its way back to the cave.
- It only took me five minutes to make my way back to the house.
- The man called Leo made his way back to the US.
- She published a book on a princess who made her way back to the castle.
return to
- He suggests that he returned to the house before and had a perfect alibi.
- I was willing to return to my house now.
- Changed into dress, she returned to her house.
- As he returned to his house on duty, he got fired.
- She sent me a fax which asked me to return to office in time.
What become of
- I didn't know what become of her three years ago.
- I was gonna write an article on what become of the inhabitants.
- I didn't know what become of her, why did she smash everything to pieces?
- Imagine his dismay when he found out what become of his parents.
- So long as you tell me what become of her, I will reward you with $100.

** 跟读 50遍
** DONE Comprehension 反复练习
CLOSED: [2024-01-05 Fri 19:35]
