NCE3/L36 A chance in a million.html
<div id="outline-container-org674bbe2" class="outline-3">
<h3 id="org674bbe2">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
<div id="outline-container-orgc7c1e4f" class="outline-3">
<h3 id="orgc7c1e4f"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-orgc7c1e4f">
<p>
a chance in a million<br />
</p>
<ul class="org-ul">
<li>There is a chance in a million that you win the lottery.<br /></li>
<li>There is a chance in a million that I make a name for myself.<br /></li>
<li>There was a chance in a million that she came to play football.<br /></li>
<li>There is a chance in a million that he offers to do the dishes.<br /></li>
<li>There is a chance in a million that our company makes a profit this year.<br /></li>
</ul>
<p>
bring &#x2026; to a conclusion<br />
</p>
<ul class="org-ul">
<li>As the writer was put out of business, he couldn't bring his novel to a conclusion.<br /></li>
<li>He brought his novel to a conclusion by a accident setting up a series of reactions.<br /></li>
<li>He brought his novel to a conclusion by appearing a driver who pulled up.<br /></li>
<li>He brought his novel to a conclusion by getting the traffic on the move again.<br /></li>
<li>He brought his story to a conclusion<br />
by the situation that prince and princess live happily together.<br /></li>
</ul>
<p>
sb. accepted the fact that<br />
</p>
<ul class="org-ul">
<li>We accepted the fact that our child failed the exam.<br /></li>
<li>He accepted the fact that his son was killed in action during war.<br /></li>
<li>The boss accepted the fact that his workmen was in traffic jam.<br /></li>
<li>He accepted the fact that his room was littered with junk foods.<br /></li>
<li>I accepeted the fact that the chest I hid was prised open by someone.<br /></li>
</ul>
<p>
bring about<br />
</p>
<ul class="org-ul">
<li>This brought about the kidnap of my cat.<br /></li>
<li>They conspired to destory the suspended bridge<br />
so that this brought about the downfall of our president.<br /></li>
<li>They plotted to bring about the president's downfall.<br /></li>
<li>Everyone cherishes the hope that this brought about the president's downfall.<br /></li>
<li>The mere fact that it brought about the president's downfall has a deep influence on me.<br /></li>
</ul>
<p>
and so on<br />
</p>
<ul class="org-ul">
<li>A rabbit was carved from a wood, and so on.<br /></li>
<li>The kidnapper asked for a ransom of $10,000, and so on.<br /></li>
<li>Considering his lovable cat, he agreed to pay a ransom of $10,000, and so on.<br /></li>
<li>Following my father's instrcutions, I kept my word and went to the police, and so on.<br /></li>
<li>She explained that there were girls, boys, and so on.<br /></li>
</ul>
<p>
anyone but<br />
</p>
<ul class="org-ul">
<li>My fellow told me that anyone but you takes the task seriously.<br /></li>
<li>Anyone but you changed your mind and followed Mr Leo's instructions.<br /></li>
<li>Sure enough, anyone but your husband commited a murder.<br /></li>
<li>Anyone but the poor gilr didn't leav in an orderly fashion.<br /></li>
<li>It astounded me that anyone but you went in front of the camp up and down.<br /></li>
</ul>
<p>
be thought to<br />
</p>
<ul class="org-ul">
<li>The woman was thought to be a servant who poisoned her five husbands.<br /></li>
<li>The puma was thought to escape from a private collector.<br /></li>
<li>I was thought to take my job seriously.<br /></li>
<li>He was thought to be killed in action during war.<br /></li>
<li>He was thought to have seen a puma at large.<br /></li>
</ul>
<p>
stop to do<br />
</p>
<ul class="org-ul">
<li>I stopped to prove it right.<br /></li>
<li>He stopped to catch sight of his father.<br /></li>
<li>I'm glad that you stopped to study.<br /></li>
<li>He stopped to have a rest in the afternoon.<br /></li>
<li>He stopped to show his identity car to the security in front of the gate.<br /></li>
</ul>
<p>
comment on<br />
</p>
<ul class="org-ul">
<li>It is disturbing to hear that someone comments on a film that we haven't seen.<br /></li>
<li>She gets used to commenting on other's personal lifes in the open.<br /></li>
<li>No one will comment on a room that was used as a place of worship.<br /></li>
<li>It is considered unlucky for people commenting on god at the monastery.<br /></li>
<li>She was expect to comment on our story in the contest.<br /></li>
</ul>
<p>
suggest that + &#x2026;<br />
</p>
<ul class="org-ul">
<li>I suggest that she played truent from school.<br /></li>
<li>I suggest that this will cause an strange situation.<br /></li>
<li>She suggests that she got enough money to buy the house.<br /></li>
<li>I suggest that I get used to working in office.<br /></li>
<li>She suggests that the room was used a place of worship.<br /></li>
</ul>
<p>
there is/was a chance that + &#x2026;<br />
</p>
<ul class="org-ul">
<li>There is a chance that she will give us a surprise.<br /></li>
<li>There is a chance that the archaeologist made a real discovery.<br /></li>
<li>There is a chance that a bargain hunter found something valuable in antique shop.<br /></li>
<li>There is a chance that she recognized your brother as her father.<br /></li>
<li>There is a chance that she was quipped with a torchlight.<br /></li>
</ul>
<p>
needless to say<br />
</p>
<ul class="org-ul">
<li>Needless to say, she happened to wander around the park.<br /></li>
<li>Needless to say, the ring dates back to 10th century.<br /></li>
<li>Needless to say, he was amazed to find that they had to abandon ship.<br /></li>
<li>Needless to say, it turned out to be a little boy.<br /></li>
<li>Needless to say, he sacrificed his pocket money for a long journey.<br /></li>
</ul>
<p>
towards the end of + sth.<br />
</p>
<ul class="org-ul">
<li>People return to their home towards the end of the year.<br /></li>
<li>I'll keep the secret towards the end of the month.<br /></li>
<li>You'll have the privilege of meeting the queen towards the end of the year.<br /></li>
<li>She didn't take a shower towards the end of the year.<br /></li>
<li>We are gonna to keep the status quo towards the end of the year.<br /></li>
</ul>
<p>
be separated from<br />
</p>
<ul class="org-ul">
<li>He was separetaed from his unit and survived.<br /></li>
<li>It was me who was separeted from my parents at very young age.<br /></li>
<li>Such is human nature, that we are unwilling to be separeted from our couple.<br /></li>
<li>This can give rise to curious situation,<br />
as it did in the case of Mr. Leo who was separeted from his wife.<br /></li>
<li>The man separeted from his wife during the war was persumed dead.<br /></li>
</ul>
<p>
make one's way back to<br />
</p>
<ul class="org-ul">
<li>The turtle goes to extreme to make its way back to the sea.<br /></li>
<li>In the end, the snake makes its way back to the cave.<br /></li>
<li>It only took me five minutes to make my way back to the house.<br /></li>
<li>The man called Leo made his way back to the US.<br /></li>
<li>She published a book on a princess who made her way back to the castle.<br /></li>
</ul>
<p>
return to<br />
</p>
<ul class="org-ul">
<li>He suggests that he returned to the house before and had a perfect alibi.<br /></li>
<li>I was willing to return to my house now.<br /></li>
<li>Changed into dress, she returned to her house.<br /></li>
<li>As he returned to his house on duty, he got fired.<br /></li>
<li>She sent me a fax which asked me to return to office in time.<br /></li>
</ul>
<p>
What become of<br />
</p>
<ul class="org-ul">
<li>I didn't know what become of her three years ago.<br /></li>
<li>I was gonna write an article on what become of the inhabitants.<br /></li>
<li>I didn't know what become of her, why did she smash everything to pieces?<br /></li>
<li>Imagine his dismay when he found out what become of his parents.<br /></li>
<li>So long as you tell me what become of her, I will reward you with $100.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgabbeabc" class="outline-3">
<h3 id="orgabbeabc">跟读 50遍</h3>
</div>
<div id="outline-container-org1dc735b" class="outline-3">
<h3 id="org1dc735b"><span class="done DONE">DONE</span> Comprehension 反复练习</h3>
<div class="outline-text-3" id="text-org1dc735b">
</div>
</div>
