English/NCE3/L36 A chance in a million.org
** DONE Ask me if 写+读
CLOSED: [2024-01-05 Fri 19:44]
1. We are less credulous than we used to be. Why
	 Why are we less credulous than we used to be?
2. Novel readers used to accept wildly improbable endings. What
		What did novel readers use to accept?
3. Modern readers could accept such solutions. Why couldn't
		Why couldn't modern readers accept such solutions?
4. Incredible coincidences occur in real life. When
		When do incredible coincidences occur in real life?
5. Franz recognized his brother when he first met him. Why didn't
		Why didn't Franz recognized his brother when he first met him?
6. Mrs. Bussman discovered that the workman was Franz's long-lost brother. How
	 How did Mrs. Bussman discover that the workman was Franz's long-lost brother?
7. Hans had been sent to hospital after he had been wounded. When
	 When had Hans been sent to hospital?
8. The hospital had been bombed. What
	 What had been bombed?
9. All records of him had been destoryed. What
	 What had been destoryed?
10. Hans had settled down in a village fifty miles away. Where
		Where had Hans settled down?
	 
** DONE 摘要写作 写 & 对答案
CLOSED: [2024-01-05 Fri 19:57]
Hans Busman had been sent to hospital and was separated from his unit.
The hospital was bombed so that he had to return to his home.
Because his unit was lost, all his records missed.
He found the house had been bombed and on one knew what had happened to his family.
Then he settled down in a village where he had remained ever since
	util he met Franz and his wife.

Hans had been wounded towards the end of the war, taken to hospital and separted from his unit.
When the hospital had been bombed, he had returned to West Germany on foot.
Meantime, his unit had been lost and all records of him destoryed.
He returned to the family home to find the house bombed.
Assuming all his family were dead,
	he settled in a village 50 miles away wwhere he had lived until he met Franz and his wife.


** DONE tell the story 口语复述
CLOSED: [2024-01-05 Fri 20:01]
** composition 阅读 或 写作
When the war finished,
	Franz Bussman did everything he could to get information about his brother Hans.
With no information, he reluctantly assumed his brother was dead and gave up the search.
With no family, and having been unable to find his brother,
	Franz found it difficult to settle down.
Over the years he moved from place to place and from job to job,
	never staying very long in one place.
When he met Anna (now Mrs. Bussman),he was working as a waiter in a hotel.
He and Anna got married and Franz settled down at last.
He moved from the dinning room into the kitchen of the hotel and became a cook.
But this did not last very long.

He was talking to a friend one day, a taxi driver,
	who suggested that they should go into partnership.
So they did, and Franz became a taxi driver.
He and the friend drove taxis themselves,
	but they also soon owned four more taxis and employed four drivers.
He visited his home town once to visit his old house, but it was a sad visit.
There was a large modern block of flats where his family house used to be.
And although he spoke to some of the apartment owners,
	no one remembered him or his family.
Now that he has finally found his brother Hans,
	he and Anna are planning to invite Hans to come
		and live near them
		and work as a taxi driver in the company.

** Topics for discussion
