NCE3/L36 A chance in a million.html
<div id="outline-container-org74231ae" class="outline-3">
<h3 id="org74231ae"><span class="done DONE">DONE</span> Ask me if 写+读</h3>
<div class="outline-text-3" id="text-org74231ae">
<ol class="org-ol">
<li>We are less credulous than we used to be. Why<br />
Why are we less credulous than we used to be?<br /></li>
<li>Novel readers used to accept wildly improbable endings. What<br />
What did novel readers use to accept?<br /></li>
<li>Modern readers could accept such solutions. Why couldn't<br />
Why couldn't modern readers accept such solutions?<br /></li>
<li>Incredible coincidences occur in real life. When<br />
When do incredible coincidences occur in real life?<br /></li>
<li>Franz recognized his brother when he first met him. Why didn't<br />
Why didn't Franz recognized his brother when he first met him?<br /></li>
<li>Mrs. Bussman discovered that the workman was Franz's long-lost brother. How<br />
How did Mrs. Bussman discover that the workman was Franz's long-lost brother?<br /></li>
<li>Hans had been sent to hospital after he had been wounded. When<br />
When had Hans been sent to hospital?<br /></li>
<li>The hospital had been bombed. What<br />
What had been bombed?<br /></li>
<li>All records of him had been destoryed. What<br />
What had been destoryed?<br /></li>
<li>Hans had settled down in a village fifty miles away. Where<br />
Where had Hans settled down?<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org7449504" class="outline-3">
<h3 id="org7449504"><span class="done DONE">DONE</span> 摘要写作 写 &amp; 对答案</h3>
<div class="outline-text-3" id="text-org7449504">
<p>
Hans Busman had been sent to hospital and was separated from his unit.<br />
The hospital was bombed so that he had to return to his home.<br />
Because his unit was lost, all his records missed.<br />
He found the house had been bombed and on one knew what had happened to his family.<br />
Then he settled down in a village where he had remained ever since<br />
	util he met Franz and his wife.<br />
</p>

<p>
Hans had been wounded towards the end of the war, taken to hospital and separted from his unit.<br />
When the hospital had been bombed, he had returned to West Germany on foot.<br />
Meantime, his unit had been lost and all records of him destoryed.<br />
He returned to the family home to find the house bombed.<br />
Assuming all his family were dead,<br />
	he settled in a village 50 miles away wwhere he had lived until he met Franz and his wife.<br />
</p>
</div>
</div>


<div id="outline-container-org344adff" class="outline-3">
<h3 id="org344adff"><span class="done DONE">DONE</span> tell the story 口语复述</h3>
<div class="outline-text-3" id="text-org344adff">
</div>
</div>
<div id="outline-container-org1fcda5c" class="outline-3">
<h3 id="org1fcda5c">composition 阅读 或 写作</h3>
<div class="outline-text-3" id="text-org1fcda5c">
<p>
When the war finished,<br />
	Franz Bussman did everything he could to get information about his brother Hans.<br />
With no information, he reluctantly assumed his brother was dead and gave up the search.<br />
With no family, and having been unable to find his brother,<br />
	Franz found it difficult to settle down.<br />
Over the years he moved from place to place and from job to job,<br />
	never staying very long in one place.<br />
When he met Anna (now Mrs. Bussman),he was working as a waiter in a hotel.<br />
He and Anna got married and Franz settled down at last.<br />
He moved from the dinning room into the kitchen of the hotel and became a cook.<br />
But this did not last very long.<br />
</p>

<p>
He was talking to a friend one day, a taxi driver,<br />
	who suggested that they should go into partnership.<br />
So they did, and Franz became a taxi driver.<br />
He and the friend drove taxis themselves,<br />
	but they also soon owned four more taxis and employed four drivers.<br />
He visited his home town once to visit his old house, but it was a sad visit.<br />
There was a large modern block of flats where his family house used to be.<br />
And although he spoke to some of the apartment owners,<br />
	no one remembered him or his family.<br />
Now that he has finally found his brother Hans,<br />
	he and Anna are planning to invite Hans to come<br />
		and live near them<br />
		and work as a taxi driver in the company.<br />
</p>
</div>
</div>

<div id="outline-container-orgd6873d7" class="outline-3">
<h3 id="orgd6873d7">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
